In [1]:
import pandas as pd
df = pd.read_csv('students.csv', header=2)
df.head()

   30572   Alex   1.0  0.84  92.0   89.0  94.0  92.0.1  91.0  2020-01-10 14:00
0  39203  Avery  0.84  0.74  68.0   70.0  84.0    90.0  82.0  2020-01-20 14:00
1  39203  Avery  0.84  0.74  68.0   70.0  84.0    90.0  82.0  2020-01-20 14:00
2  28592   Kris  0.96   NaN  82.0   94.0  90.0    81.0  84.0  2020-01-22 11:00
3  27492   Rick  0.32   NaN  98.0  100.0  73.0    82.0  88.0  2020-01-23 13:00

In [2]:
df = pd.read_csv('students.csv')
df.head()

,ID,Name,Attendance,HW,Test1,Project1,Test2,Project2,Final,datenow
0,27604,Joe,0.96,0.97,87.0,98.0,92.0,93.0,95.0,2020-01-24 12:00
1,30572,Alex,1.00,0.84,92.0,89.0,94.0,92.0,91.0,2020-01-10 14:00
2,39203,Avery,0.84,0.74,68.0,70.0,84.0,90.0,82.0,2020-01-20 14:00
3,39203,Avery,0.84,0.74,68.0,70.0,84.0,90.0,82.0,2020-01-20 14:00
4,28592,Kris,0.96,NaN,82.0,94.0,90.0,81.0,84.0,2020-01-22 11:00

In [3]:
df = pd.read_csv('students.csv', header=None)
df.head()

,0,1,2,3,4,5,6,7,8,9
0,ID,Name,Attendance,HW,Test1,Project1,Test2,Project2,Final,datenow
1,27604,Joe,0.96,0.97,87.0,98.0,92.0,93.0,95.0,2020-01-24 12:00
2,30572,Alex,1.0,0.84,92.0,89.0,94.0,92.0,91.0,2020-01-10 14:00
3,39203,Avery,0.84,0.74,68.0,70.0,84.0,90.0,82.0,2020-01-20 14:00
4,39203,Avery,0.84,0.74,68.0,70.0,84.0,90.0,82.0,2020-01-20 14:00

In [4]:
lables = ['uID','Name','Attendance','HW','Test1','Project1','Test2','Project2','Final']
df = pd.read_csv('students.csv', names=lables,)
df.head()

,uID,Name,Attendance,HW,Test1,Project1,Test2,Project2,Final
ID,Name,Attendance,HW,Test1,Project1,Test2,Project2,Final,datenow
27604,Joe,0.96,0.97,87.0,98.0,92.0,93.0,95.0,2020-01-24 12:00
30572,Alex,1.0,0.84,92.0,89.0,94.0,92.0,91.0,2020-01-10 14:00
39203,Avery,0.84,0.74,68.0,70.0,84.0,90.0,82.0,2020-01-20 14:00
39203,Avery,0.84,0.74,68.0,70.0,84.0,90.0,82.0,2020-01-20 14:00

In [5]:
df.dtypes

uID           object
Name          object
Attendance    object
HW            object
Test1         object
Project1      object
Test2         object
Project2      object
Final         object
dtype: object

In [6]:
type(df['uID'][0])

str

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, ID to 27492
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   uID         7 non-null      object
 1   Name        7 non-null      object
 2   Attendance  5 non-null      object
 3   HW          7 non-null      object
 4   Test1       7 non-null      object
 5   Project1    7 non-null      object
 6   Test2       7 non-null      object
 7   Project2    7 non-null      object
 8   Final       7 non-null      object
dtypes: object(9)
memory usage: 560.0+ bytes

In [8]:
df.nunique()

uID           6
Name          5
Attendance    4
HW            6
Test1         6
Project1      6
Test2         6
Project2      6
Final         6
dtype: int64

In [9]:
df.describe()

,uID,Name,Attendance,HW,Test1,Project1,Test2,Project2,Final
count,7,7,5,7,7,7,7,7,7
unique,6,5,4,6,6,6,6,6,6
top,Avery,0.84,0.74,68.0,70.0,84.0,90.0,82.0,2020-01-20 14:00
freq,2,2,2,2,2,2,2,2,2

In [10]:
df.tail(1)['uID']

27492    Rick
Name: uID, dtype: object

In [11]:
df_means = df.loc[:,'uID':'Attendance']
df_means.head(90)

         uID        Name Attendance
ID      Name  Attendance         HW
27604    Joe        0.96       0.97
30572   Alex         1.0       0.84
39203  Avery        0.84       0.74
39203  Avery        0.84       0.74
28592   Kris        0.96        NaN
27492   Rick        0.32        NaN

In [12]:
df_means = df.iloc[:,:3]
df_means.head()

         uID        Name Attendance
ID      Name  Attendance         HW
27604    Joe        0.96       0.97
30572   Alex         1.0       0.84
39203  Avery        0.84       0.74
39203  Avery        0.84       0.74

In [13]:
df = pd.read_csv('students.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          6 non-null      int64
 1   Name        6 non-null      object
 2   Attendance  6 non-null      float64
 3   HW          4 non-null      float64
 4   Test1       6 non-null      float64
 5   Project1    6 non-null      float64
 6   Test2       6 non-null      float64
 7   Project2    6 non-null      float64
 8   Final       6 non-null      float64
 9   datenow     6 non-null      object
dtypes: float64(7), int64(1), object(2)
memory usage: 608.0+ bytes

In [14]:
df.HW.mean()

0.8225

In [15]:
df.HW=df.HW.fillna(df.HW.mean())

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          6 non-null      int64
 1   Name        6 non-null      object
 2   Attendance  6 non-null      float64
 3   HW          6 non-null      float64
 4   Test1       6 non-null      float64
 5   Project1    6 non-null      float64
 6   Test2       6 non-null      float64
 7   Project2    6 non-null      float64
 8   Final       6 non-null      float64
 9   datenow     6 non-null      object
dtypes: float64(7), int64(1), object(2)
memory usage: 608.0+ bytes

In [17]:
df.HW.fillna(df.HW.mean(), inplace=True)

In [18]:
df.duplicated().sum()

1

In [19]:
df.drop_duplicates(inplace=True)

In [20]:
df.head(20)

,ID,Name,Attendance,HW,Test1,Project1,Test2,Project2,Final,datenow
0,27604,Joe,0.96,0.9700,87.0,98.0,92.0,93.0,95.0,2020-01-24 12:00
1,30572,Alex,1.00,0.8400,92.0,89.0,94.0,92.0,91.0,2020-01-10 14:00
2,39203,Avery,0.84,0.7400,68.0,70.0,84.0,90.0,82.0,2020-01-20 14:00
4,28592,Kris,0.96,0.8225,82.0,94.0,90.0,81.0,84.0,2020-01-22 11:00
5,27492,Rick,0.32,0.8225,98.0,100.0,73.0,82.0,88.0,2020-01-23 13:00

In [21]:
df.datenow

0    2020-01-24 12:00
1    2020-01-10 14:00
2    2020-01-20 14:00
4    2020-01-22 11:00
5    2020-01-23 13:00
Name: datenow, dtype: object

In [22]:
df.datenow=pd.to_datetime(df.datenow)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 5
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          5 non-null      int64
 1   Name        5 non-null      object
 2   Attendance  5 non-null      float64
 3   HW          5 non-null      float64
 4   Test1       5 non-null      float64
 5   Project1    5 non-null      float64
 6   Test2       5 non-null      float64
 7   Project2    5 non-null      float64
 8   Final       5 non-null      float64
 9   datenow     5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(7), int64(1), object(1)
memory usage: 440.0+ bytes

In [23]:
df = pd.read_csv('cancer_data.csv')

In [24]:
df.symmetry_max.fillna(df.symmetry_max.mean(), inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 569 entries, 0 to 568
Data columns (total 32 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   id                      569 non-null    int64
 1   diagnosis               569 non-null    object
 2   radius_mean             569 non-null    float64
 3   texture_mean            548 non-null    float64
 4   perimeter_mean          569 non-null    float64
 5   area_mean               569 non-null    float64
 6   smoothness_mean         521 non-null    float64
 7   compactness_mean        569 non-null    float64
 8   concavity_mean          569 non-null    float64
 9   concave_points_mean     569 non-null    float64
 10  symmetry_mean           504 non-null    float64
 11  fractal_dimension_mean  569 non-null    float64
 12  radius_SE               569 non-null    float64
 13  texture_SE              548 non-null    float64
 14  perimeter_SE            569 non-null    float64
 15  area_SE                 569 non-null    float64
 16  smoothness_SE           521 non-null    float64
 17  compactness_SE          569 non-null    float64
 18  concavity_SE            569 non-null    float64
 19  concave_points_SE       569 non-null    float64
 20  symmetry_SE             504 non-null    float64
 21  fractal_dimension_SE    569 non-null    float64
 22  radius_max              569 non-null    float64
 23  texture_max             548 non-null    float64
 24  perimeter_max           569 non-null    float64
 25  area_max                569 non-null    float64
 26  smoothness_max          521 non-null    float64
 27  compactness_max         569 non-null    float64
 28  concavity_max           569 non-null    float64
 29  concave_points_max      569 non-null    float64
 30  symmetry_max            569 non-null    float64
 31  fractal_dimension_max   569 non-null    float64
dtypes: float64(30), int64(1), object(1)
memory usage: 142.4+ KB

In [25]:
sum(df.duplicated())

5

In [26]:
df.drop_duplicates(inplace=True)

In [27]:
sum(df.duplicated())

0